# SetLayoutAsNumberWithSpacing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..SetLayoutAsNumberWithSpacing Method
RebarFreeFormAccessor Class See Also
---
Sets the Layout Rule property of rebar set to Number With Spacing.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetLayoutAsNumberWithSpacing(
	int numberOfBars,
	double spacing
)
```

Visual Basic
---
```text
Public Sub SetLayoutAsNumberWithSpacing ( _
	numberOfBars As Integer, _
	spacing As Double _
)
```

Visual C++
---
```text
public:
void SetLayoutAsNumberWithSpacing(
	int numberOfBars,
	double spacing
)
```

# ### Parameters
numberOfBars
    Type: System..::..Int32 The number of bars in set.
spacing
    Type: System..::..Double The spacing of bars in set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace